<?php

/**
 * Таблиця "Мови" `language`
 */

return [
    'crud_menu' => false,
    'crud_edit' => false,
    'title' => 'Мови',
    'icon_menu' => 'language',
    'columns' => [
        'id' => ['type' => 'string', 'size' => 2, 'pk' => true, 'comment' => 'Код',],

        'name'    => ['type' => 'string', 'size' => 16, 'comment' => 'Назва', 'unique' => true,],
        'default' => ['type' => 'boolean', 'default' => 0, 'comment' => 'Дефолтна',],
        'active'  => ['type' => 'boolean', 'default' => 1, 'comment' => 'Активно',],
        'flag'    => ['type' => 'text', 'comment' => 'SVG-код картинки флага',],
    ],
    'defaultOrder'   => ['name' => SORT_ASC],
    'gridColumns'    => [
        'id',
        'name',
        'default:boolean',
        'active:boolean',
    ],
    'viewAttributes' => [
        'gridColumns',
    ],
    'formFields'     => [
        [['name', 'type' => 'text',],],
        [['flag', 'type' => 'text',],],
        [['default', 'type' => 'checkbox',],],
        [['active', 'type' => 'checkbox',],],
    ],
    // TODO: Без прапорів
    //'fill' => [
    //    ['id' => 'en', 'name' => 'English',    'default' => false,  'active' => true,],
    //    ['id' => 'de', 'name' => 'German',     'default' => false,  'active' => false,],
    //    ['id' => 'fr', 'name' => 'French',     'default' => false,  'active' => false,],
    //    ['id' => 'ru', 'name' => 'Русский',    'default' => false,  'active' => false,],
    //    ['id' => 'uk', 'name' => 'Українська', 'default' => true,   'active' => true,],
    //],
    // TODO: З прапорами
    'fill' => [
        ['id' => 'en', 'name' => 'English', 'default' => false, 'active' => true, 'flag' => '<svg width="32" height="32" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512" enable-background="new 0 0 512 512"><circle cx="256" cy="256" r="256" fill="#F0F0F0"/><g fill="#0052B4"><path d="M52.92 100.142c-20.109 26.163-35.272 56.318-44.101 89.077h133.178l-89.077-89.077zM503.181 189.219c-8.829-32.758-23.993-62.913-44.101-89.076l-89.075 89.076h133.176zM8.819 322.784c8.83 32.758 23.993 62.913 44.101 89.075l89.074-89.075h-133.175zM411.858 52.921c-26.163-20.109-56.317-35.272-89.076-44.102v133.177l89.076-89.075zM100.142 459.079c26.163 20.109 56.318 35.272 89.076 44.102v-133.176l-89.076 89.074zM189.217 8.819c-32.758 8.83-62.913 23.993-89.075 44.101l89.075 89.075v-133.176zM322.783 503.181c32.758-8.83 62.913-23.993 89.075-44.101l-89.075-89.075v133.176zM370.005 322.784l89.075 89.076c20.108-26.162 35.272-56.318 44.101-89.076h-133.176z"/></g><g fill="#D80027"><path d="M509.833 222.609h-220.441v-220.442c-10.931-1.423-22.075-2.167-33.392-2.167-11.319 0-22.461.744-33.391 2.167v220.441h-220.442c-1.423 10.931-2.167 22.075-2.167 33.392 0 11.319.744 22.461 2.167 33.391h220.441v220.442c10.931 1.423 22.073 2.167 33.392 2.167 11.317 0 22.461-.743 33.391-2.167v-220.441h220.442c1.423-10.931 2.167-22.073 2.167-33.392 0-11.317-.744-22.461-2.167-33.391zM322.783 322.784l114.236 114.236c5.254-5.252 10.266-10.743 15.048-16.435l-97.802-97.802h-31.482v.001zM189.217 322.784h-.002l-114.235 114.235c5.252 5.254 10.743 10.266 16.435 15.048l97.802-97.804v-31.479zM189.217 189.219v-.002l-114.236-114.237c-5.254 5.252-10.266 10.743-15.048 16.435l97.803 97.803h31.481zM322.783 189.219l114.237-114.238c-5.252-5.254-10.743-10.266-16.435-15.047l-97.802 97.803v31.482z"/></g></svg>'],
        ['id' => 'de', 'name' => 'German', 'default' => false,  'active' => false, 'flag' => '<svg width="32" height="32" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512" enable-background="new 0 0 512 512"><path d="M15.923 345.043c36.171 97.484 130.006 166.957 240.077 166.957s203.906-69.473 240.077-166.957l-240.077-22.26-240.077 22.26z" fill="#FFDA44"/><path d="M256 0c-110.071 0-203.906 69.472-240.077 166.957l240.077 22.26 240.077-22.261c-36.171-97.484-130.006-166.956-240.077-166.956z"/><path d="M15.923 166.957c-10.29 27.733-15.923 57.729-15.923 89.043s5.633 61.31 15.923 89.043h480.155c10.29-27.733 15.922-57.729 15.922-89.043s-5.632-61.31-15.923-89.043h-480.154z" fill="#D80027"/></svg>'],
        ['id' => 'fr', 'name' => 'French', 'default' => false,  'active' => false, 'flag' => '<svg width="32" height="32" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512" enable-background="new 0 0 512 512"><circle cx="256" cy="256" r="256" fill="#F0F0F0"/><path d="M512 256c0-110.071-69.472-203.906-166.957-240.077v480.155c97.485-36.172 166.957-130.007 166.957-240.078z" fill="#D80027"/><path d="M0 256c0 110.071 69.473 203.906 166.957 240.077v-480.154c-97.484 36.171-166.957 130.006-166.957 240.077z" fill="#0052B4"/></svg>'],
        ['id' => 'ru', 'name' => 'Русский', 'default' => false, 'active' => false, 'flag' => '<svg width="32" height="32" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512" enable-background="new 0 0 512 512"><circle cx="256" cy="256" r="256" fill="#F0F0F0"/><path d="M496.077 345.043c10.291-27.733 15.923-57.729 15.923-89.043s-5.632-61.31-15.923-89.043h-480.154c-10.29 27.733-15.923 57.729-15.923 89.043s5.633 61.31 15.923 89.043l240.077 22.261 240.077-22.261z" fill="#0052B4"/><path d="M256 512c110.071 0 203.906-69.472 240.077-166.957h-480.154c36.171 97.485 130.006 166.957 240.077 166.957z" fill="#D80027"/></svg>'],
        ['id' => 'uk', 'name' => 'Українська', 'default' => true, 'active' => true, 'flag' => '<svg width="32" height="32" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512" enable-background="new 0 0 512 512"><circle style="fill:#FFDA44;" cx="256" cy="256" r="256"/><path style="fill:#338AF3;" d="M0,256C0,114.616,114.616,0,256,0s256,114.616,256,256"/></svg>'],
    ],
];
